{
    "abstract": "Irrigated agriculture is the most water-consuming sector in Brazil,representing one of the main challenges for the sustainable use of water. Thisstudy proposes and experimentally evaluates univariate time series models thatpredict the value of reference evapotranspiration, a metric of the water loss fromcrop to the environment. Reference evapotranspiration plays an essential rolein irrigation management since it can be used to reduce the amount of waterthat will not be absorbed by the crop. The experiments performed under themeteorological dataset generated by a weather station. Moreover, the resultsshow that the approach is a viable and lower cost solution for predicting E'To,since only a variable needs to be monitored.",
    "1. Introduction": " Population growth and changes in climate directly impact on worldwide food security.One of the primary objectives of agricultural research is to find improved ways to producefood. According to [Thiago et al. 2017], 72% of freshwater is consumed in irrigation, inBrazil. It is estimated that a massive portion of this amount is wasted due to poorlyexecuted irrigation and lack of control from farmers about the exact amount of water touse in irrigation process. Evapotranspiration value (£7,,) plays a key role in support to decision makingin irrigation management, which is the simultaneous occurrence of evaporation and transpiration processes in a crop, measured in millimeters per a unit of time. We use thefollowing equation to compute it: ET, = K. x ET, where K, is the crop coefficientc, given at INMET website!, ET) is the reference crop evapotranspiration, which corresponds to the evapotranspiration rate of a grass surface. The value of F’7 is very relevantto management and scaling in irrigation since it gives the information of how much waterthe crop loses to the environment [Thiago et al. 2017]. The traditional Penman-Monteith method [Allen et al. 1998] used to computeE;To is complex and does not tolerate the unavailability of some of its variables, whichmakes its use unfeasible. The paper [Caminha et al. 2017] proposes a Machine Learningbased approach to forecast £75 based on Linear Regression [James et al. 2013] and M5P[Wang and Witten 1996]. Despite the good results obtained in both techniques, they are multivariate models, which means that it requires a weather station with many sensors tocapture all the required variables, and there is no guarantee that models will fit, as well asin the absence of some variables. Experiments performed by [Siami-Namini and Namin 2018] with univariate timeseries model demonstrated the Autoregressive Integrated Moving Average (ARIMA)[Box et al. 2015] model as a promising technique to achieve good accuracy performancein the forecast of financial time series. ARIMA model aims at describing the correlations in the data with each other. An improvement over ARIMA is Seasonal ARIMA(SARIMA) [Box et al. 2015], which takes into account the seasonality of dataset and wassuccessfully used in short-term forecast [Tseng and Tzeng 2002]. In this paper, we useboth approaches in our experiments. The key contributions of this paper are: (i) offer an accurate and lower cost solution to estimate F’'7o, since only a variable needs to be monitored; (11) compare theperformance of ARIMA, SARIMA, Linear Regression and M5P with respect to minimization achieved in the error rates in prediction; and (111) release the dataset used in thiswork, for research and possible improvements by the scientific community. The remaining sections of this article are organized as follows. Section 2 explainsour proposed approach. Section 3 shows the steps necessary to accomplish our goals.Section 4 presents our experiments and its analysis. Finally, Section 5 summarizes thiswork and proposes future developments.",
    "2. Time Series Forecasting": " A time series (TS) is a series of data records indexed by dates. A time series model supposes that a series Z, could be defined as Z; = 7; + S; + a, being J’ the tendency, Sthe seasonality and a the white noise, at a moment ¢ [Brockwell and Davis 2016]. Mostof the 7S models work on the assumption that the T'S is stationary, i.e., its statisticalproperties such as mean and standard deviation remain constant over time. Due to manyreal-time series being non-stationary, statisticians had figured out ways to make 73S stationary [Box et al. 2015]. In particular, differencing operator (V) is a simple and efficient operator to transform a non-stationary 7'S to stationary. It is defined by the equation: VZ; = 2% — Z-1,where Z is a 7'S at a moment ¢ [Brockwell and Davis 2016]. In other words, we take thedifference of the observation at a particular instant ¢ with that at the previous instant ¢ — 1. The ARIMA model takes three hyper-parameters p, d,g, which capture the keyelements of the model, which are: (1) Autoregression (AR), a regression model that usesthe relationship between an observation and a number (p) of lagged observations; (11) Integrated (/), the number (d) of differentiation required to obtain stationarity; (111) MovingAverage (MA), an approach that takes into accounts the dependency between observations and the residual error terms when a moving average model is used for the laggedobservations (qg) [Box et al. 2015, Tseng and Tzeng 2002]. The SARIMA model incorporates both seasonal and non-seasonal factor in a T'Sdata, its signature is SARI M A(p, d, q) x (P, D, Q)S, where p and P are the non-seasonaland seasonal AR order; d and D are the non-seasonal and seasonal differencing; g and Qare the non-seasonal and seasonal MA order; and S is the time span of repeating seasonal",
    "3. Methodology": "",
    "3.1. Data Collection and Cleaning": " The climatic data were collected by a weather station, in the period from January, Istto November, 29th of 2017 in the city of Quixada, Ceara, Brazil. The original datasetcontains 7941 hourly records, and it is composed of the features described in Table 1. Thisdataset is available inhttps://github.com/Dieinison/ProjectET0O/blob/ Table 1. Samples from datasetDate Preciptation | Wind SpeedNN Mine Maw [Mine [Mean Mane Mine] Mean Tota) Mean” [Mane Ming) ne2017-11-29 599.7 19.6 | 32 45.3 | 50.1 12.7 | 214 | 196 0.0 |S) 158 7 | 0.0952017-11-29 599.7 19.4] 32 41.9 | 46.9 11.9 | 217 at] 0.0 ;] 1.73 | | 0.109 We aggregated the original hourly data on a daily basis.detected outliers observations through Proximity-Based Outlier Detection technique[Tan et al. 2006] and remove them. The tuples contain the values described in Table 2were removed. At the end of this procedure, 333 tuples remained.",
    "3.2. Prediction models": " To create the prediction models, we split the dataset into 80% for training and 20% fortesting. Each algorithm produced its particular model using the attributes taken as input.Thus, we generated four distinct models, Linear Regression and M5P were created fromall the attributes of the dataset, ARIMA and SARIMA models were generated only withET. These models and their comparisons are presented in Section 4. For purposes of comparisons between the models generated, we used the samedataset (given by weather station from UFC Quixada). We performed the prediction models by applying the Linear Regression and M5P algorithms, both implemented in theWEKA* tool. In order to forecast through ARIMA and SARIMA, we perform the Box-Jenkinsmethodology [Box et al. 2015], defined as: (1) identification of the model, 1.e., finding theappropriate orders for p, d,g, P, D, Q, S; (ii) estimation of the unknown parameters; (ili)validation of the model; and (iv) forecast future outcomes based on the known data.",
    "3.3. Models Evaluations": " To evaluate both techniques, the Root Mean Squared Error(RMSE) and Mean AbsoluteError (MAB) are calculated as the evaluation metrics of the performance, defined by where 7 is the sample index, n is the total number of observations, y is the expected attribute value and y is the value output by the algorithm used [James et al. 2013]. Bothmetrics can range from 0 to oo. They are negatively-oriented scores, which means lowervalues are better. RMSE has the benefit of penalizing large errors, while MAE is a mea",
    "4. Experiments and Results": " As stated earlier, these experiments used a real dataset with observations collected from aweather station located in Campus UFC Quixada, in Brazil. Initially, we generated the Machine Learning-based approaches, through WEKAtool. Due to lack of space, we do not present in this paper our Linear Regression andM5P prediction models. They are available in http://bit.ly/result_linear_regressionandhttp://bit.ly/result_m5p, respectively. With the view to generate time series models, we checked stationarity by plottingrolling average and rolling standard deviation as shown in Fig.1. The evaluated meanand standard deviation show significant instability over time, suggesting the data is nonstationary. Another technique to evaluate the non-stationary is the Dickey-Fuller (DF)test. The DF is a unit root test that evaluates the strength of trend in a time series component [P. Avishek 2017]. The output for DF test is shown in Table 3. As we can see, theDF Statistic is higher than the critical values, so this series is non-stationary. Thereforewe can approach this with ARIMA models. In order to obtain the optimal hyper-parameters for ARIMA and SARIMA models, we used a function, called auto arima, from Pyramid’, an API under MIT License that provide an systematic approach to find the best hyper-parameters, based on a giveninformation criteria, which in this case will be the Corrected Akaike Information Crite rion (AIC), as recommended in [Brockwell and Davis 2016]. This criterion includes apenalty term to discourage the fitting of too many parameters, 1.e., the fitted model withthe smaller value of AJC, will be the best choice [Smith 2017, P. Avishek 2017]. Tables4 and 5 present the parameters output by auto arima function for ARIMA and SARIMAmodels, respectively. Table 6 shows RMSEs and MAEs generated from models. As we can see, the univariate ARIMA and SARIMA models presented error values very low as it is close tozero. A value of RMSE or MAE equals to zero would that the estimator is predicting observations with perfect accuracy. Besides, in Table 7, we showed statistical properties ofour label variable, E7, thus, as errors rates (RMSE and MAB) are less than the standarddeviation, our results indeed show a good accuracy [Legates and McCabe 1999]. The results show an outperformance of multivariate model M5P, under RMSEand MAE metrics, over univariate time series models. Nevertheless, univariate time series models show us that these models indeed fit well the data, since there were small differences between predictions and expected values. Regarding TS models, ARIMAoutperformed SARIMA in both metrics, indicating that our data is better fitted by a non Due to the costs of owning a weather station with many sensors, capture all thevariables required for multivariate models might not be affordable for low-income farmers. In contrast, the results show us that an ARIMA model is an affordable solution forpredicting £7, since only a variable needs to be monitored, with no need of multiples",
    "5. Conclusion": " This paper compares the accuracy of univariate ARIMA and SARIMA models with multivariate Machine Learning-based algorithms, Linear Regression and M5P. The resultsshow that M5P outperform the other techniques. Despite that, this paper advocates thebenefits of applying univariate time series algorithms to predict E'7o, since these modelspresented small differences between predictions and expected values, 1.e., good accuracy.Besides, TS models might be an affordable solution for low-income farmers, since only avariable needs to be monitored. For future works, we aim at improving and validating ourproposed models for other datasets and compare with deep learning based approaches. Allen, R. G., Pereira, L. S., Raes, D., Smith, M., et al. (1998). Crop evapotranspirationguidelines for computing crop water requirements-fao irrigation and drainage paper56. FAO, Rome, 300(9):D05 109. Box, G. E., Jenkins, G. M., Reinsel, G. C., and Ljung, G. M. (2015). Time series analysis:forecasting and control. John Wiley & Sons, New Jersey, USA. Brockwell, P. J. and Davis, R. A. (2016). Introduction to time series and forecasting. Caminha, H., Silva, T., Rocha, A., and Lima, S. (2017). Estimating reference evapotranspiration using data mining prediction models and feature selection. Proceedings ofthe 19th International Conference on Enterprise Information Systems (ICEIS 2017), James, G., Witten, D., Hastie, T., and Tibshirani, R. (2013). An introduction to statisticallearning, volume 112. Springer, New York, USA. Legates, D. R. and McCabe, G. J. (1999). Evaluating the use of goodness-of-fit measures in hydrologic and hydroclimatic model validation. Water resources research,35(1):233-241. P. Avishek, P. P. (2017). Practical Time Series Analysis: Master Time Series Data Processing, Visualization, and Modeling using Python. Packt, Birmingham, UK. Siami-Namini, S. and Namin, A. S. (2018). Forecasting economics and financial timeseries: Arima vs. Istm. arXiv preprint arXiv: 1503.06386. Tan, P.-N. et al. (2006). Introduction to data mining. Pearson Education India, India. Thiago, H. F., Wagner, M. d. C., and Marcus, A. F. (2017). Atlas irrigacdo: uso da dguana agricultura irrigada. Agéncia Nacional de Aguas, Brasilia, DF, Brasil. Tseng, F.-M. and Tzeng, G.-H. (2002). A fuzzy seasonal arima model for forecasting.Fuzzy Sets and Systems, 126(3):367—-376. Wang, Y. and Witten, I. H. (1996). Induction of model trees for predicting continuousclasses."
}