{
    "abstract": "This paper presents the experience report of mini programming androbotics minicourses for teenager girls from Macaé and region. The aim ofthis work is to encourage women for the careers of sciences, engineering andcomputing, and to advertise the undergraduate courses in Engineering offeredby Federal University of Rio de Janeiro (UFRJ) for these young women. Theminicourses took place in partnership with teachers from three public schoolsand reached a total of 50 tennagers, 35 of whom were female. Throughout theclasses, it was possible to observe the interest of the students in the activitiescarried out in the Engineering courses and the curiosity to learn more about",
    "1. Introducao": " As inovacoes cientificas estao avan¢ando a uma taxa exponencial. No entanto, para todosesses avancos, as mulheres representam menos de um terco dos pesquisadores cientificosem todo o mundo [UNESCO 2018] e uma variedade de barreiras sistémicas muitas vezesdesencorajam as meninas de buscar ciéncia e tecnologia. O ensino da computacao é presente no curriculo escolar em diversos paises[Hubwieser et al. 2015]. No Brasil a computacao ainda é ministrada apenas nos cursostécnicos e em cursos afins no ensino superior. Entretanto, a SBC tem sugestao sobrea implementacao da computac¢ao nas escolas brasileiras [Raabe et al. 2017], e incentivadiversos projetos cujo objetivo é 0 ensino e divulgacao da computacio!. 'Projetos chancelados pela SBC: https://www.sbc.org.br/institucional-3/chancela-sbe O objetivo deste trabalho é incentivar a formagdo de mulheres para as carreirasde ciéncias exatas, engenharias e computacao em Macaé e regiao e divulgar os cursosde graduacaéo em Engenharia oferecidos pela Universidade Federal do Rio de JaneiroCampus Macaé (UFRJ) para essas jovens. Nesse artigo sera apresentado o relato de experiéncia dos minicursos de programacao e robotica. Esses minicursos visam divulgara ciéncia da computacaéo para mulheres e incentiva-las a serem criadoras de tecnologias, Além do aprendizado de programacao ao longo do curso, as jovens tém a oportunidade de conhecer mais sobre a UFRJ e ter contato com graduandas(os) da Engenhariapara trocas de experiéncias e possiveis esclarecimentos sobre as profissoes. Essas atividades aconteceram em parceria com professoras de trés escolas publicas e com os projetosde extensaéo Aprenda a Programar Jogando que visa divulgar o ensino da computa¢ao paracriangas e jovens e Garotas Cientistas que visa incentivar a formacao de mulheres paracarreiras das exatas.",
    "2. Metodologia": " Foram planejados dois minicursos. | O minicurso de Robotica para Jovens e dePython+Matematica. A seguir serao descritos 0 objetivo de cada curso, plano de aulas",
    "2.1. Robotica para Jovens": " Esse minicurso tem como proposta 0 ensino de programac¢ao para crian¢as e jovens, associando Ciéncia, Tecnologia, Artes e Engenharia. A tematica das aulas é projetos deEngenharia, que sao desenvolvidos com diferentes enfoques para criancas e jovens. Aoapresentar os temas de Engenharia para criangas, essas sao estimuladas a pensarem edescreverem o funcionamento do protétipo utilizando a criatividade. Para os jovens, osprojetos de Engenharia sao contextualizados dentro dos cursos de graduacao, divulgandopossiveis carreiras e profissoes. A metodologia possui seis etapas que acontecem ao longo das aulas. Na primeiraaula os monitores apresentam a /deia do Projeto e escrevem o algoritmo de como é 0 seufuncionamento; em seguida, os alunos iniciam a Programacdo utilizando a ferramentaScratch e se ambientam com a programacéo em bloco. A terceira etapa é a Eletroénicana qual os alunos montam circuitos e entendem do funcionamento dos componentes. Emseguida eles montam a Maquete do projeto com materials reciclaveis e a pr6xima faseé a programacao da Robética na qual blocos adicionais com comandos de robdética saoutilizados no Scratch para programarem o projeto. Na ultima etapa, a Consolidacdo osalunos juntam as etapas anteriores para finalizacgao do projeto. Os projetos contemplam areas da Engenharia Civil e Engenharia Mecanica e suasetapas abrangem conceitos basicos de programagao. O projeto da Ponte Levadica, compreende o acionamento automatico de luzes com o uso de fotorresistores (LDRs). Nodesenvolvimento do projeto os monitores discutem com os alunos 0 papel da Engenharia em buscar solugdes com menor impacto ambiental e mais econdmicas. E, 0 projetodo Braco Mecdnico, é composto por um mecanismo dividido em duas partes moventes,com funcionamento parecido a uma retroescavadeira. No desenvolvimento do projetoos monitores discutem com os alunos qual sera 0 movimento da estrutura ao acionar osservomotores, conceitos de dinaémica dos corpos rigidos.  a 1.| Conteldos de matematica das turmas realizadas do minicursoPython+Matematica. Esses conteudos sao apresentados nas aulas 2 e 3.",
    "2.2. Python+Matematica": " O minicurso tem por objetivo principal a integracgao entre o estudo da programacao econtetidos de matematica ensinados nas escolas. Deste modo, é proposto aos alunos umaalternativa para compreender e resolver problemas matematicos, utilizando linguagem deprogramacao. O minicurso foi realizado de forma remota, sendo as videoaulas gravadas e disponibilizadas no YouTube. A linguagem de programacao utilizada foi o Python, e osprogramas feitos em aula foram disponibilizados no Google Collaboratory. Uma apostila foi produzida com contetido extra de programacao para orientar os alunos e, também,servir de material complementar. Para acompanhar os alunos, foi sugerido que fizessem comentarios no Youtube etambém foram utilizados formularios do Google. Esses formularios tinham como objetivoacompanhar a satisfa¢ao dos alunos e avaliar o aprendizado. O planejamento do minicurso envolve quatro aulas. A aula inicial é sobre a linguagem de programacao Python, ensinando conceitos basicos da programa¢éo. As proximasduas aulas com conteudo especifico de matematica, a primeira envolvendo a explicacao doconteudo e a segunda a resolucao de exercicios utilizando Python. A ultima aula contéma revisao final, abordando todos os conceitos aprendidos durante o curso. A Tabela 1contém os conteudos de matematica sugeridos pelas professoras das escolas parceiras.",
    "3. Resultados": " Os minicursos foram ministrados por graduandos de Engenharia da UFRJ. Em todas asturmas houve a participacao de dois monitores, seja na aula presencial do minicurso derob6ética ou na elabora¢ao das videoaulas no minicurso de Python. A realizagao dos cursosaconteceram em parceria com os projetos de extensao Aprenda a Programar Jogando e oprojeto de extensao Garotas Cientistas.",
    "3.1. Robotica para Jovens": " O minicurso de Robotica possuiu carga horaria de quatro horas divididas em dois encontros. No total 11 alunos, sendo 10 do sexo feminino, sem conhecimento prévio emcomputacao, participaram das atividades. Os alunos tinham entre 11 e 17 anos de idadee foram acompanhados até a UFRJ por duas professoras das escolas parceiras para arealizacao das atividades. A avaliacao do aprendizado dos alunos foi realizada por meio de um questionarioe pela observacao dos monitores ao longo das atividades. O questionario contemplava perguntas abrangendo conhecimentos de programacao, eletronica e robética. Quanto aosconceitos de programacao, as respostas eram em texto livre e cerca de 85% dos alunos definiram corretamente 0 que era programacéo e responderam corretamente sobre 0 uso doconceito de comandos condicionais. Em relagao aos conceitos de eletrénica e robdética, foi solicitado que o participante relacionasse 0 conceito tedrico descrito com 0 componente eletroOnico equivalente. Mais de 92% dos participantes responderam corretamentesobre: servo motor, protoboard, LED, Arduino e resistor. Na avaliacao feita pelos alunos, mais de 95% relataram gostar da experiéncia eaproximadamente 85% disseram querer aprender mais sobre programacao e Engenharia.No formato proposto, o curso ofereceu beneficios para escolas ou projetos que possuemlimitagao de tempo, visto que foi realizado em dois encontros. Contudo, para o aprofundamento dos temas de programac¢ao e eletrénica sao necessarias mais aulas. A baixacarga horaria também afetou algumas etapas da metodologia. Por exemplo, os alunosdas oficinas de robotica para jovens nao puderam montar suas proprias maquetes, queforam disponibilizadas prontas pelos monitores. Portanto, as atividades foram focadas naelaboracéo da logica de programagao, circuito eletronico e robética.",
    "3.2. Python+Matematica": " O minicurso foi realizado em parceria com trés escolas publicas de Macaé. Cada escolafoi representada por uma professora que fazia a conexao entre os instrutores do curso e osalunos da escola. O questionario inicial contou com 39 respostas, sendo 24 do sexo feminino. 29respostas foram de alunos do 1° ano do Ensino Médio, 9 do 2° ano do Ensino Médio eapenas | aluno do 7° ano do Ensino Fundamental, todos com pouco ou nenhum conhecimento em programacao. Ao final, 15 alunos responderam o ultimo questionario, em queapresentaram um dominio maior sobre conceitos basicos da linguagem de programacao. Foram realizados dois questionarios a serem preenchidos pelos alunos, um noinicio e outro no final do curso. No primeiro, ao serem questionados sobre suas expectativas profissionais para o futuro, das 39 respostas, apenas 7 eram da area de exatas/tecnologia, sendo | de programagao. Além disso, apenas 8 alunos possuiem conhecimento prévio de programacao. Quanto ao questionario final, o objetivo principal foi avaliar a evolugao dos alunose a opiniao deles quanto ao curso oferecido. O primeiro indicador é sobre a dificuldadeque eles sentiram em seguir e reproduzir o conteudo das aulas, onde das 26 respostas,cinco alunos classificaram como um nivel de dificuldade de 5 em 10, considerado intermediario, todos os demais atribuiram valores mais baixos, sendo 38% nivel de dificuldade3 em 10. Ao serem questionados quanto ao contetido que mais gostaram de aprender,houve respostas como ”uma maneira mais facil e diferente de vocé aprender e usar amatematica’ou ainda esses comandos que juntos tem uma capacidade grande de resolver muita coisa’, além de observag6es quanto ao contetido e dinamica das aulas: ’gosteimuito da dinamica dos videos aulas, com 6tima explicagaéo”. Por fim, foi aplicado umpequeno teste com algumas questoes relacionadas aos contetidos das aulas, que em suamaioria provou que os alunos de fato aprenderam com o conteudo passado. Além das dificuldades relatadas em memorizar os comandos basicos da programagao, os alunos, em suamaioria, disseram gostar da possibilidade de integrar a programacao com a matemiéatica, de forma a facilitar a aprendizagem do contetido, desenvolvendo técnicas baseadas nosconceitos de programagao aprendidos e inserindo-os em seus estudos cotidianos. Por fim, foi enviado um questionario as professoras, onde elas relataram que aevasdo dos alunos no minicurso pode ser atribuida ao fato de que as aulas oferecidas naoeram obrigat6érias, bem como a falta de acesso a internet pela maioria dos alunos, comotambém a aprovacéo automatica decretada pelo Estado para os colégios, o que contribuiupara a dispersao dos estudantes.",
    "4. Conclusao": " A iniciativa divulgada neste artigo se mostrou promissora e destaca como meninas e muIheres podem ser motivadas a estudar e construir carreiras em Computac¢ao, ao fortalecercurriculos através da criacao de materiais de aprendizagem e garantir participacao de meninas em aulas de programacaéo e robética. Em ambos os minicursos realizados o publicofoi majoritariamente feminino, atingindo o objetivo proposto inicialmente e os alunosgostaram de terem participado das atividades. Além disso, por meio dos questiondarios deavaliacao realizados ao final das atividades pode-se observar que o conteudo do curso foi Ao longo do contato com os alunos observou-se que grande parte nao tinha conhecimento dos cursos de Engenharia que sao oferecidos pela Universidade Federal doRio de Janeiro. Ao terem contato com os instrutores graduandos de Engenharia e visitarem a UFRJ, os alunos vislumbraram essa nova possibilidade de carreira atingindo outroobjetivo desse trabalho. Entretanto, muito trabalho ainda precisa ser feito para atingir plenamente a igualdade de género na educacao e fornecer meios e oportunidades equitativosé de extrema importancia. Dentre os trabalhos futuros, pretende-se criar novos projetos de robética e desenvolvé-los com turmas de faixas etarias diferentes. Pretende-se também criar parcerias comoutras professoras das escolas para realizacgao de novas turmas do curso de programacaéoem Python com temas de matematica. Esse formato online possibilita também reproduziras video aulas para outras turmas sem necessidade de gravacao de novas aulas. Alémdisso, deseja-se reestruturar 0 questionario aplicado ao final das atividades para acrescentar novas perguntas, visando melhorar a forma de avaliacao do aprendizado dos alunos. Hubwieser, P., Giannakos, M. N., Berges, M., Brinda, T., Diethelm, I., Magenheim, J.,Pal, Y., Jackova, J., and Jasute, E. (2015). A global snapshot of computer science education in k-12 schools. In Proceedings of the 2015 ITiCSE on Working Group Reports,ITICSE-WGR ’15, page 65-83, New York, NY, USA. Association for Computing Ma Raabe, A., Frango, I., Ribeiro, L., Granville, L., Salgado, L., da Cruz, M., and Fortes,S. (2017). Referenciais de formagao em computa¢éo: Educacgao basica. Sociedade UNESCO (2018). Decifrar o cédigo: educacdo de meninas e mulheres em ciéncias,tecnologia, engenharia e matemdtica (STEM). Organizacgao das Nacoes Unidas para aEducagao, a Ciéncia e a Cultura (UNESCO)."
}