{
    "abstract": "The Brazilian poultry industry has been gaining prominence as amajor producer and occupies the top position in the world ranking. In thisreview, based on an exploratory survey, there are presented research outcomeswith Artificial Intelligence (AI) throughout the production chain in broilerpoultry farming, from behavior analysis for disease identification and slaughterweight prediction, to quality control. With a period beginning with theinternational release of Industry 4.0, there are described 26 papers whichdemonstrate the growing adoption of AI and its divisions.",
    "1. Introducao": " A cadeia produtiva de frangos de corte ¢ uma das cadeias mais importantes noagronegoécio brasileiro (BASSI; SILVA, 2017), o que ¢ corroborado ao analisar-se osdados de producao e exportacao desse setor. De acordo com relatério 2021 da Associa¢aoBrasileira de Proteina Animal (ASSOCIACAO BRASILEIRA DE PROTEINAANIMAL, 2021), em 2020 0 Brasil produziu 13,845 milhdes de toneladas de carne defrango e exportou 4,231 milhdes de toneladas, o que torna o pais o maior exportadormundial do produto, sendo que dessa exportacao, 66,99% ¢é do produto tipo cortes, comfrango inteiro, embutidos, salgados e industrializados complementando este percentual.No estudo feito por Bassi e Silva (2018), os autores afirmam que os grandes avancos dapesquisa no desenvolvimento de novas tecnologias no setor da avicultura ajudaram aposicionar o Brasil em termos de producao e exportacao mundial. Nesse contexto, éinteressante observar que a agroindustria, assim como a industria de modo geral, vempassando por um processo de revolu¢ao tecnoldgica conhecido como Industria 4.0, ondeas chamadas tecnologias habilitadoras 4.0, dentre elas a Inteligéncia Artificial (IA),permitem nao apenas otimizar e monitorar processos, mas também auxiliar na tomada dedecisao, estando usualmente integrada as camadas de modelagem supervisionada e naosupervisionada em algoritmos de ciéncia de dados. No caso do agronegocio, tem sido comum adotar genericamente o termoAgricultura 4.0 e nesse caso, tais tecnologias também fomentam a agricultura de precisao,na qual busca-se adotar \"estratégias de manejo mais eficientes, considerando avariabilidade espacial e temporal da unidade produtiva, permitindo o uso adequado dosinsumos a fim de evitar desperdicios\" (SANTANA; OLIVEIRA, 2021). E comum aadocao dos termos inteligente ou smart para diferenciar da pratica convencional. Naproduc¢ao animal, a zootecnia de precisao tem se ocupado de quest6es \"para supervisao eanalise em tempo real da sade, nutri¢ao, comportamento e ambiéncia, visando os indicesprodutivos, reprodutivos e bem-estar animal de forma automatica, continua, nao invasivae sem gerar estresse ao animal” (ROCHA; SILVA, 2020). O tema tem, inclusive,motivado a ampliagcao de chamadas publicas, como o Programa Agro 4.0 da AgénciaBrasileira de Desenvolvimento Industrial (ABDI), cujo 1° edital selecionou e premiou 14projetos pilotos de ado¢ao e de difusao de tecnologias 4.0 no agronegdcio (BRASIL,2020a). Na mesma linha seguiu a Financiadora de Estudos e Projetos (FINEP), comchamada de subven¢ao econdmica as empresas em tecnologias 4.0, incluindo o setoragropecuario (BRASIL, 2020b). Devido ao volume, variedade e velocidade de dados disponiveis para gera¢ao deconhecimento, a IA tem sido muito explorada na atualidade em solucoes para cidades,saude e industria. Nao seria diferente para o setor agropecuario, onde a IA encontraadequa¢ao natural a complexidade de mapeamento das relacdes bioldgicas e deambiéncia. Diante do exposto, este artigo tem como objetivo fazer um levantamentoexploratorio inicial sobre como a JA tem sido adotada na avicultura de frango de corte noperiodo que configura o inicio do conceito Industria 4.0, destacando as principaisaplicagdes e identificagao de demandas para o avanco da area a partir desta tecnologiahabilitadora.",
    "2. Material e Métodos": " Com base na metodologia PRISMA para organizacao de revisdes bibliograficas(MOTHER et al., 2009), para a etapa de identificagao, foi utilizada a busca geral porassunto no Portal de Periddicos CAPES, com acesso federado via Cafe/RNP, com a string(\"machine learning” OR \"artificial intelligence\") AND (broiler OR poultry OR chickenOR aviculture). Dado que a busca contempla por padrao os campos Titulo, Resumo,Abstract, Palavras-Chave, o uso da string com termos em lingua inglesa tambémcontempla as principais bases indexadoras (Springer, IEEE, Science Direct) e periddicosnacionais. De 4.176 trabalhos, sao apresentados o total de 26 estudos, apds aplicacao doscritérios de inclusao: periodo de 2016-2021, avicultura de frango de corte, trabalhoscompletos indexados e revisados por pares. Adicionalmente, os critérios de exclusaoforam aplicados: avicultura de postura, énfase em Internet das Coisas U/nternet of Things,IoT), nao frango, e com conteudo nao diretamente relacionado, além da remo¢ao deduplicados. A busca com termos em portugués: (“inteligéncia artificial’ OR“aprendizagem de maquina’) AND (frango OR avicultura) nao retornou resultados. Embora trabalhos com IoT apresentem intersec¢des e possam contemplar etapasadicionais de analise e tratamento dos dados, revisdes especificas para o aspecto deinstrumenta¢ao podem ser encontradas em Oliveira et al. (2019) e Astill et al. (2020). Operiodo dos ultimos cinco anos foi selecionado de modo a coincidir com a promogao dotermo Industria 4.0 a partir do trabalho de Schwab (2016) e sua relagao com IA.",
    "3. Resultados e Discussao": " Dos 26 estudos listados, usando o critério de afiliagao do primeiro autor e institui¢ao deconduc¢ao da pesquisa, o Brasil encontra-se em 2. lugar, com 3 trabalhos, atras apenas daChina, com 6 trabalhos. Os demais artigos distribuem-se pela Asia, América do Norte eEuropa. A representa¢ao brasileira inclui os estados de Sao Paulo e Parana (RIBEIRO etal., 2019; BARBON et al., 2018; PEREZ et al., 2018), com instituigdes como Unicamp,USP, UEL, UFPR, UTFPR e PUC-PR. Da gestao e manejo das condicdes de ambiéncia em aviarios para aprimoramentosno bem-estar animal (RIBEIRO et al., 2019), selegao genética de matrizes, produtividadee deteccao antecipada de enfermidades, ao processamento agroindustrial em suas etapasde controle de qualidade, o melhor conhecimento do processo por meio da analiseautomatizada dos dados de producao baseada em IA, maximiza a assertividade da tomadade decisao e o cumprimento de exigéncias sanitarias para os mercados mais exigentes.Estudos criticos como em Rowe et al. (2019) discutem, contudo, que o enfoque aindapermanece em ganhos de produtividade, nao necessariamente considerando 0 aspecto debem-estar animal. No caso de frangos de corte, com ambientes de alta densidade depopula¢ao e ciclo curto (em média 45 dias), este fato demanda maior atencao pelosagentes envolvidos e tem sido alvo de investigagao com base em analise de imagens(OKINDA et al, 2020). E digno de nota que alguns autores chamam a atencdo para aconsolidacgao de estratégias existentes antes da adocao de tecnologias disruptivasassociadas ao 4.0, caracterizando 0 conceito intermediario de Industria 3.5 (WANG et al, Neste sentido, de modo a contemplar a diversidade de aplicacgées, os trabalhoscategorias (i) diagnésticodoengas/bioinformatica veterinaria (11) monitoramento de produ¢ao e processamento. Este trabalho portanto amplia e atualiza o estudo de Milosevic et al. (2019). Dada aatualidade do tema de bioinformatica, este topico foi adicionado a categoria (1) sob oenfoque veterinaério. O termo ‘processamento’ na categoria (11) busca contemplar oconceito farm-to-fork, incluindo o controle de qualidade dos produtos. A Tabela 1 abaixo resume as areas de aplicac¢ao e tarefas baseadas em técnicas de",
    "3.1. Diagnostico de doencas/bioinformatica veterinaria": " A identificagao precoce de condi¢oes de gatilho para doen¢as comuns em aviarios a partirde variaveis de ambiéncia, bem como 0 monitoramento de comportamento sao problemasde pesquisa que fomentam a relacgao academia-industria, sendo tais estudos frutos deparcerias ou realizados em instalac6es proprias de institutos de pesquisa e universidades,reproduzindo as condi¢oes reais do setor produtivo em escala adequada. Banakar et al.(2016) propoem um modelo de estudo para o diagnostico inteligente de doengas aviariascom base em sinais sonoros dos frangos, utilizando um dispositivo para diagnosticardoencas aviarias, como a Influenza Aviaria, a Doencga de Newcastle (ND) e Virus daBronquite (BV), usando métodos de minera¢ao de dados e teoria da evidéncia DempsterShafer (D-S). Além da vocalizacao, Astill et al. (2018) revisam estudos de modelospreditivos para deteccao de gripe aviadria que consideram uma variedade de fontes, comanalises de imagens, video e robotica movel, para inspecao de animais mortos ou doentes,além da limpeza no ambiente. Na mesma linha, Cuan et al. (2020) focam no virus da gripeaviaria H9N2. O método proposto detecta sons complexos emitidos pelas aves baseadonas diferencas espectrais, obtendo um espectrograma para entrada na rede neuralconvolucional. Numa abordagem diferenciada e baseada em série historica de dados,Yousefinaghani et al. (2021) definem um framework e dataset com escala espacgotemporal para predicao de ocorréncia e disseminacgao em area geografica, com utilizagaode features associadas a gripe aviaria. Com o avanco da tecnologia de sensores, equipamentos de deteccao, econsequente inje¢ao de dados nos sistemas inteligentes, a antecipacao de acdes e disparode alarmes resultante da opera¢ao pode ser um diferencial inovador. Por exemplo, Zhuanget al. (2018) apresentam um sistema de alerta baseado em imagens de cameras e extragaode features, para classificar a pose/comportamento de aves saudaveis e doentes. O modelode Maquina de Vetores de Suporte (SVM) com hiperparametros e a funcao de kernelPOLY se destacou, atingindo uma precisao de 99,46% nas amostras de teste. De modosimilar, Fang et al. (2021) comparam frameworks de redes neurais profundas paraestimacgao nao invasiva de pose e identificagao de diferentes movimentos das aves eassociacao as enfermidades, com destaque para o classificador Naive Bayes. A bioinformatica enquanto area multidisciplinar com enfoque na determina¢ao degenes, proteinas, e suas relagoes, encontra atual e relevante aplica¢ao na area veterinaria,com especial atencao a avicultura. Visto o volume de dados e relacgées estatisticasinerentes, técnicas de IA e aprendizagem de maquina tém sido empregadas. A selecao ecombina¢ao otima de marcadores genéticos, para fins de qualidade e tolerancia acontaminantes das matrizes (PASSAFARO et al., 2020; POLEWKO-KLIM et al., 2020)e posterior rastreabilidade de origem (SEO et al., 2021) sao exemplos de aplicag¢oes emcrescimento. Destaca-se a parceria de Passafaro et al. (2020) com a empresa CobbVantress, valorizando a interacao academia-industria.",
    "3.2. Sistemas de monitoramento de producao": " O acompanhamento do ganho de peso diario ¢ determinante para atender aos padroes daindustria, garantindo a remuneracgao adequada dos agentes envolvidos e qualidade finaldos produtos. Existem sistemas de pesagem automatica baseados em balan¢as, imagensou uma combinagao de ambos. Uma ampla revisao sobre técnicas baseadas em imagens,nao apenas para frango de corte, pode ser encontrada em Nyalala et al. (2021).Mortensen et al. (2016), a partir de dataset rotulado com 13.000 imagens para treinamento de rede neural Bayesiana, utilizaram camera 3D para capturar o frango sobreuma balanc¢a, obtendo 12 descritores de peso diferentes que permitem estimar o pesoindividual. Amraei et al. (2018) propdem um sistema equivalente, com dataset de 2440imagens e combinagao da Transformada de Hough (HT) generalizada e método de ChanVese para segmentacao. Os 6 descritores obtidos sao utilizados para construgao demodelo de regressao para predicao de peso. Diferentemente, Wang et al. (2021) propd6emuma estrutura baseada em dados, incluindo dois médulos para monitoramento e previsaode peso, por meio de analise de big data coletados da nuvem da Amazon (AWS),incluindo sinais eletronicos coletados das granjas por meio de varios sensores edispositivos. O mddulo de monitoramento de peso ¢ construido por um modelo queintegra uma mistura gaussiana, reamostragem de bootstrapping e técnica de médiaponderada para estimar o peso atual de frangos de corte vivos na granja. Dada acomplexidade em filtrar dados obtidos de balangas automaticas e maximizar suaconfiabilidade, You et al. (2021) comparam os algoritmos K-Nearest Neighbors (KNN),Random Forest, SVM e redes neurais para classificacgao de outliers, obtendo melhoresresultados com o Random Forest. Seja no processamento das carnes no frigorifico (YUSOF et al., 2020), naidentificagao da qualidade de carne em aves saudaveis para exigéncias sanitarias regionaisou culturais (FAJAR, 2018), ou na classificagao das partes do frango (PEREZ et al.,2018), o uso combinado de cameras hiperespectrais, para aquisi¢ao de dados com JA ¢comum em varios trabalhos. Kollenburg et al. (2020) investigaram a autenticidade de filésde frango com base em imagens no espectro Infravermelho Proximo (NIR) e técnicas deestatistica multivariada, enquanto Kamruzzaman et al. (2016) utilizaram regressao porminimos quadrados parciais para deteccao de adulteragao em carne moida de frango.Analise semelhante foi realizada por Barbon et al. (2018) porém com utiliza¢ao de arvorede decisao. Mais recentemente, a presenga de contaminantes no figado do frango foiinvestigada por Dourou et al. (2021), com op¢ao pela combinacao de arvores de decisao(Extra Trees) para extracao de caracteristicas e SVM para classifica¢gao.",
    "4. Conclusdes": " A presente revisao apresentou resultados de pesquisa bibliografica no periodo 2016-2021de sistemas baseados em JA aplicados a avicultura de frangos de corte. Dada a amplitudedos contetdos dos trabalhos, foi adotada a classificacao nas categorias de diagnostico dedoengas/bioinformatica veterinaria e sistemas de monitoramento de produg¢ao, incluindo O diagnostico antecipado e com assertividade, com indica¢gao de previsao ouprobabilidade da ocorréncia de doencgas em frangos de corte ¢ de grande interesse pratico,com abordagens baseadas em monitoramento de comportamento e correlagdes com aambiéncia do aviario. Adicionalmente é notorio 0 avanco nas pesquisas de bioinformaticapara principalmente o melhoramento genético para minimizar suscetibilidade a doengas.De modo complementar, os sistemas de monitoramento de producao visam otimizar apredi¢ao de peso de abate, com estudos de técnicas que possam filtrar medidas de pesoindevidas ou incoerentes. Destaca-se 0 numero expressivo de trabalhos na etapa decontrole de qualidade da carne de frango, com utilizag¢ao de cameras hiperespectrais noespectro NIR em combinacao com aprendizagem de maquina. A presenga da IA ¢ realidade na avicultura industrial de frangos de corte, dado ocontexto internacional da pesquisa. Embora ainda caracterizada como um elementodiferenciador, espera-se que a incorporacao da IA venha a ser natural no futuro proximo,dada a gama de ferramentas e plataformas disponiveis que abstraem a complexidade deseus algoritmos e facilitam a adocao. Aliada a outras tecnologias habilitadoras 4.0, asaber, IoT, big data e computacao em nuvem, tem demonstrado contribuir para aprodutividade, com amplo campo de pesquisa e problemas em aberto na cadeia deproducao. Dado o estagio de desenvolvimento das grandes empresas avicolas nacionais eos recordes de exporta¢ao, a adocao das tecnologias 4.0, em particular a IA, pode estarinserida nos processos frigorificos e de logistica, necessitando de maior adocao pelosavicultores, principalmente para manejo de ambiéncia e acompanhamento de ganho depeso. Embora os resultados de pesquisa cientifica com os critérios adotados neste trabalhonao apontem para publica¢oes resultantes da relagao industria-academia nacional, fatorescomo sigilo por propriedade intelectual e priorizagao por publicag¢ao em eventos seraoconsiderados em trabalhos futuros. AMRAETL S.; MEHDIZADEH, S. A.; NAAS, I. A. Development of a transfer function forweight prediction of live broiler chicken using machine vision. Engenharia Agricola, v.38, p. 776-782, 2018. ASSOCIACAO BRASILEIRA DE PROTEINA ANIMAL. Relatério anual 2021. 2021.Disponivel em: <https://abpa-br.org/relatorios/>. Acesso em: 18/ago. 2021. ASTILL, J. et al.. Smart poultry management: smart sensors, big data, and the internet ofthings. Computers and Electronics in Agriculture, v. 170, 105291, 2020. ASTILL, J. et al. Detecting and predicting emerging disease in poultry with theimplementation of new technologies and big data. Frontiers in Veterinary Science, v.5, 263, 2018. BANAKAR, A.; SADEGHI, M.; SHUSHTARI, A. An intelligent device for diagnosingavian diseases: Newcastle, infectious bronchitis, avian influenza. Computers andElectronics in Agriculture, v. 127, p. 744-753, 2016. BARBON, S. et al. Machine Learning Applied to Near-Infrared Spectra for Chicken MeatClassification. Journal of Spectroscopy, v. 2018, 2018. BASSI, N.S. S.; SILVA, C. L. Oportunidades e desafios para a cadeia produtiva de frangosde corte brasileira. Avicultura Industrial, Itu, ed. 1271, ano 109, n. 10, p.16-21, 2017. BASSI, N.S. S.; SILVA, C. L. Pesquisa e Desenvolvimento na Cadeia Produtiva de Frangosde Corte no Brasil. Revista de Economia e Sociologia Rural [online], v. 56, n. 3, p. BRASIL. Agéncia Brasileira de Desenvolvimento Industrial. ABDI divulga selecionadosdo Edital Agro 4.0. 2020a. Disponivel em: <https://www.abdi.com.br/postagem/abdidivulga-selecionados-do-edital-agro-4-0>. Acesso em: 18 ago. 2021. BRASIL. Financiadora de Estudos e Projetos. Selecao publica MCTI/FINEP/FNDCT.Subvencéo econdmica a inovacaéo - tecnologias 4.0, 2020b. Disponivel em:<http://www.finep.gov.br/chamadas-publicas/chamadapublica/643>. Acesso em: 22 ago.2021. CUAN, K. et al. Detection of avian influenza-infected chickens based on a chicken soundconvolutional neural network. Computers and Electronics in Agriculture, v. 178, id. DOUROU, D. et al. Rapid microbial quality assessment of chicken liver inoculated or notwith salmonella using FTIR spectroscopy and machine learning. Frontiers inMicrobiology, v. 11, 2021. FAJAR, Y. Artificial neural network for healthy chicken meat identification. Int. Journalof Artificial Intelligence, v. 7, n. 1, p. 63-70, 2018. FANG, C. et al.. Pose estimation and behavior classification of broiler chickens based on deep neural networks. Computers and Electronics in Agriculture, v. 180, id. 105863,2021. KAMRUZZAMAN, M., MAKINO, Y., OSHITA, S. Rapid and non-destructive detectionof chicken adulteration in minced beef using visible near-infrared hyperspectral imagingand machine learning. Journal of food engineering, v. 170, p. 8-15, 2016. KOLLENBURG, G. et al. Dataset of the application of handheld NIR and machine learningfor chicken fillet authenticity study. Data in Brief, v. 29, 2020. MILOSEVIC, B. et al. Machine learning application in growth and health prediction ofbroiler chickens. World's Poultry Science Journal, v. 75, p. 401-410, 2019. MORTENSEN, A. K.; LISOUSKI, P.; AHRENDT, P. Weight prediction of broiler chickensusing 3D computer vision. Computers and Electronics in Agriculture, v. 123, p. 319326, 2016. MOTHER, D. et al. Preferred reporting items for systematic reviews and meta-analysis: thePRISMA statement. PLoS Med, 6, 1000097, 2009. NYALALA, I. et al. Weight and volume estimation of poultry and products based on cameravision systems: a review. Poultry science, v. 100, n. 5, id. 101072, 2021. OKINDA, C. et al. A review on computer vision systems in monitoring of poultry: a welfareperspective. Artificial Intelligence in Agriculture, v. 4, p. 184-208, 2020. OLIVEIRA, F. D.; SANTANA, A.; PEREIRA, L. F. A. Impactos da IoT na Avicultura:um Mapeamento Sistematico. In: XII Congresso Brasileiro de Agroinformatica,Indaiatuba, p. 418-427, 2019. PASSAFARO, T. L. et al. Would large dataset sample size unveil the potential of deep neuralnetworks for improved genome-enabled prediction of complex traits? the case of broilerweight prediction. BMC Genomics, v. 21, 771, 2020. PEREZ, N. et al. Classification of Chicken Parts Using a Portable Near-Infrared (NIR)Spectrophotometer and Machine Learning. Applied spectroscopy, v. 72, n. 12, p.17741780, 2018. POLEWKO-KLIM, A. et al. Sensitivity analysis based on random forest machine learningalgorithm identifies candidate genes for regulation of innane and adaptive immuneresponse of chicken. Poultry Science, v. 99, n. 12, p. 6341-6354, 2020. RIBEIRO, R. et al. Generating action plans for poultry management using artificial neuralnetworks. Computers and Electronics in Agriculture, v. 161, p. 131-140, 2019. ROCHA, G. B.; SILVA, I. J. O. A dinamica da Zootecnia de Precisao e tecnologias de suporte 2020. Disponive<https://www.aviculturaindustrial.com.br/imprensa/a-dinamica-da-zootecnia-deprecisao-e-tecnologias-de-suporte-atuais/20201218-085415-w971>. Acesso em: 18 ago.2021. ROWE, E.; DAWKINS, M.S.; GEBHARDT-HENRICH, S.G. A systematic review ofprecision livestock farming in the poultry sector: is technology focussed on improvingbird welfare? Animals, v. 9, 614. doi:10.3390/ani9090614, 2019. SANTANA, L.; OLIVEIRA, J. Agricultura 4.0 e o desenvolvimento de pesquisas decomputacao aplicada as ciéncias agrarias. SBC Horizontes, marco. 2021. ISSN 21759235. Disponivel em: <http://horizontes.sbc.org.br/index.php/2021/03/Agricultura-4-0e-o-desenvolvimento-de-pesquisas-de-computacao-aplicada-as-ciencias-agrarias/>.Acesso em: 18 ago. 2021. SCHWAB, K. The fourth industrial revolution. World Economic Forum, 2016. SEO, D. et al. Identification of target chicken populations by machine learning models usingminimum number of SNPs. Animals, v. 11, n. 241, 2021. WANG, C.; CHEN, Y.; CHIEN, C. Industry 3.5 to empower smart production for poultryfarming and an empirical study for broiler live weight prediction. Computers &Industrial Engineering, v. 151, id. 106931, 2021. YOUSEFINAGHANIT, S. et al. A framework for the risk prediction of avian influenzaAn YUSOF, R. et al. Image segmentation and verification based on machine learning for visioninspection of chicken slaughtering. Journal of Physics, v. 1147, n. 1, 2020. YOU, J. et al. A supervised machine learning method to detect anomalous real-time broilerbreeder body weight data recorded by a precision feeding system. Computers andElectronics in Agriculture, v. 185, 106171, 2021. ZHUANG, X. et al. Development of an early warning algorithm to detect sick broilers.Computers and Electronics in Agriculture, v. 144, p. 102-113, 2018."
}