{
    "2. Estudo de Caso": "",
    "2.1. Apresentacao e etapas de implementacao": " O escopo do projeto contemplou o uso de tecnologias IoT e IA para o monitoramento defatores de ambiéncia em aviarios de frango de corte de produtores rurais de umacooperativa no sul do Brasil, como umidade, temperatura, gases, qualidade da agua e nomonitoramento da curva de crescimento das aves por meio de pesagens automatizadas. Na solucao, os dados sao coletados por sensores, armazenados em nuvem e, como uso de Inteligéncia Artificial, analisados para se tomar a melhor decisao possiveldentro de qualquer cenario. Tanto a equipe técnica da cooperativa, quanto o associado que possui a inovacao em sua propriedade, podem consultar os indicadores em temporeal através de um aplicativo. Foram instrumentadas 15 unidades de producao (aviarios), sendo que para cadaperiodo de 60 dias, foram armazenados, ao todo, cerca de 3.822.000 registros queserviram para aplicacao de técnicas de IA para melhoramento dos processos deproducao e identificacao de causas de doencas, a partir de parametros de ambiéncia. A solucao de IA foi implementada para otimizar as médias diarias e estimativade peso final de abate em lotes mistos, além de ajudar na prevencao de doencas queacometem os lotes, auxiliando na diminuicao de condenas por aerossaculite e consistiuna combinacao de diversas variaveis e na correlacao entre elas e 0 peso.",
    "2.2. Arquitetura da solucao": " A arquitetura da solucao pode ser apresentada em trés camadas distintas: camada fisica(coleta de dados), camada de comunicacao e camada de armazenamento, gerenciamentode dados e aplicacoes (Figura 1). A camada fisica compreende os dispositivos e sensores instalados no ambienteem que as aves ficam alojadas. Como os galpoes de alojamento das aves possuemcentenas de metros quadrados, para obter dados de certos parametros com maiorconfiabilidade, foram replicados equipamentos ao longo do galpao. Cada um dos aviarios selecionados foram equipados com os seguintes sensores:a) sondas de linha: para obtencao de dados de temperatura, umidade do ar, temperaturada agua, temperatura da cama e luminosidade; b) sonda de pressao externa: paraobtencao de dados de temperatura e de umidade externa ao galpao e de pressaodiferencial do aviario; c) sonda de “CO2”, para obtencao de dados de didxido decarbono presentes no ambiente interno do galpao; d) aferidores de massa: para obtencaode dados referentes ao peso das aves; e) sonda feedmetrics (para calculo do consumo deracao e da conversao alimentar); f) sonda que mede o consumo de agua. Todos os dispositivos sao alimentados por sistema de energia disponivel noambiente de producao, sendo que possuem um sistema de bateria, que garantem seu funcionamento ininterrupto, mesmo em condicoOes em que ha a auséncia de energiaelétrica. A camada de comunicacao contempla os meios utilizados para que o dadocoletado no ambiente de producao seja enviado para um ambiente de banco de dadospara ser armazenado de forma segura. Foram utilizados radios transceptores (gateways),fazendo uso da tecnologia Lora, com a cobertura em toda a area de interesse, naonecessitando que os produtores de frangos disponibilizassem ambiente de internet paraque haja comunicacao dos dispositivos. Ja na camada de armazenamento, gerenciamento de dados e aplicacoes, foiutilizada uma base de dados em nuvem, considerando sua consolidacao no mercado erecursos disponiveis para 0 monitoramento e analise de dados. Como certos parametros tém variacoes que ocorrem de forma mais lenta, jaoutros de forma mais brusca, cada dispositivo possui uma frequéncia com a qual realizaa leitura e transmissao dos dados ao servidor, sendo os dados de peso (até 25 dados porhora, totalizando até 27.000 dados no periodo de engorda), dados de temperatura eumidade do ar (48 medicoes por hora, totalizando cerca de 52.000 registros no periodode alojamento das aves), dados de didxido de carbono (CO2) e pressao diferencial (12medicoes por hora, totalizando cerca de 13.000 registros durante o periodo dealojamento das aves). Quanto aos dados de luminosidade, temperatura da agua e temperatura da camado aviario, sao 36 medicoes por hora, totalizando cerca de 39.000 registros ao final doperiodo de alojamento das aves. Sendo assim, ao final do periodo de engorda, saoarmazenados cerca de 273.000 registros, se considerados todas as medicoes,independentemente do parametro obtido.",
    "2.3. Alguns resultados": " A solucao foi desenvolvida para coletar os dados em tempo real e transmiti-los para osenvolvidos no menor tempo possivel. Os parametros do microclima sao obtidos edisponibilizados de 5 em 5 minutos, com um diagnéstico em tempo real de como esta oambiente naquele determinado momento. O maior beneficio disso é a possibilidade que abre tanto para o avicultor comopara o extensionista de realizarem intervencoes e correcoes dentro do processo decriacao, sendo muito mais efetivo no tratamento de doencas e na busca da melhorentalpia, bem como na atuacao imediata para controlar algum aspecto de ambiéncia quecomeca a se afastar dos parametros de controle. Para isso, foi desenvolvido um sistema de alertas inteligente através de analisede cada dado que é coletado. Esses dados sao tratados e o sistema verifica se eles estaodentro do parametro desejado. Caso esses dados de ambiéncia estejam acima ou abaixodesses parametros, o sistema gera uma mensagem que é enviada ao interessado de modoque o usuario possa realizar a acao necessaria para fazer a correcao, bem como oferece apossibilidade de integracao com o sistema que existe no aviario para realizar essacorrecao de forma automatica. Outra questao é a rastreabilidade, como uma ferramenta atual de gestao daproducao primaria global de alimentos. A necessidade de se conhecer o historico dosalimentos comercializados mundialmente, deixou de ser um diferencial competitivo epassou a ser um requisito obrigatério, justificado pelas exigéncias de seguranca econfiabilidade que os grandes atacadistas e varejistas demandam. A solucao ajuda afornecer informacoes especificas de lotes que podem colaborar com um processo de A assertividade de predicao de peso (efetividade) da solucao foi avaliada,chegando ao numero proximo de 99% no caso de lote misto. Uma diferenca em torno de26 gramas de média em relacao ao peso de abate e uma margem de confianca em tomode 90% quando se avalia uma diferenca de 100 gramas para mais ou para menos.Quando os pesos estao dentro dessa margem e o frigorifico tem essa informacao comantecedéncia a consequéncia é o aumento de rendimento no aproveitamento da carcaca. A projecao de peso ao abate é uma ferramenta desenvolvida para indicar a idade,a data e o peso alvo, em virtude dos pesos médios calculados diariamente, projetando-osaté a idade desejada. Esses pesos sao gravados no sistema e podem ser utilizados peloPlanejamento e Controle da Producao - PCP. Com esta projecao, é possivel selecionardentre diversos aviarios aqueles que o sistema aponta com pesos semelhantes e maisproximo da meta que o frigorifico estabelece. Além de indicar os aviarios, é possivelfazer ajustes na linha de corte dos frangos no frigorifico, com menos intervencoes, emvirtude da menor variacao dos pesos. A partir desses resultados e da confianca nas informacoes de peso obtidas, foipossivel desenvolver um metodo de alerta de desempenho inteligente, onde o sistemarealiza trés avaliacoes. A primeira é se 0 ganho de peso diario esta em um patamaraceitavel, a segunda € uma avaliacao da tendéncia de ganho de peso do lote. Se essatendéncia indica uma queda o sistema gera uma mensagem que é encaminhada aointeressado com sugestoes de medidas que podem ser adotadas. Por fim, o sistemautiliza Inteligéncia Artificial para prever o peso futuro do lote, e caso esse peso nao sejaalcancado, uma mensagem de alerta é enviada para que as verificacoes necessariassejam feitas. Foram monitoradas as curvas de ganho de peso dos lotes, onde, ao notar pesocomprometido, o veterinario responsavel pode tomar acoes de correcao para trazer acurva de peso para o esperado. Ao mesmo passo, para efeitos de comparacao, tambémhouve lotes que nao receberam qualquer intervencao. A produtividade alcancada foisuperior a 7% do grupo dos lotes onde foram feitas as intervencoes com indicacao dasolucao, em comparacao com o grupo onde nao foi necessario fazer a intervencao. No que diz respeito a IA, em relacao a andlise de um lote especifico, a partir doalerta de aerossaculite, pode-se verificar que comportamentos de variaveis como“CO2”, amplitude térmica e umidade, submetidas a regras mais assertivas de manejo,levou a um maior controle da ventilacao e dos demais fatores de ambiéncia, quemostraram resultados positivos nesse lote, resultando em menos condenas por",
    "2.4. Principais desafios": " Entre alguns dos principais desafios para a realizacao do projeto, destacaram-se a faltade conectividade no campo, apesar de que, neste caso, foi possivel a implementacaocom a adocao de tecnologias especificas para a transmissao de dados a longa distanciarobustas contra interferéncias. Um estudo recente apontou que cerca de 70% doterritorio nacional nao possui conectividade (MAPA, 2021), o que configura um dosprincipais gargalos para a adocao de tecnologias no campo. Outros desafios estao relacionados a aspectos como a formacao basica e de maode obra dos envolvidos para a adocao da solucao tecnologica, ambiente de negocios,investimentos, governanca, seguranca e privacidade dos dados, além de questoes deinteroperabilidade entre as solucoes. Um estudo da EMBRAPA (2020) realizado comprodutores rurais na adocao de tecnologias digitais apontou que 40,9% dosentrevistados declararam a falta de conhecimento sobre quais as tecnologias digitais saomais apropriadas para sua propriedade, sendo uma das questoes também identificadasem estudos da ABDI (2021) e McKinsey (2021). Como visto, as divergéncias de peso, os lotes desuniformes com baixo desempenho elotes com problemas sanitarios, sao um grande desafio nas rotinas de trabalho na cadeiaprodutiva de frango de corte e acarretam grande desperdicio de dinheiro e de tempo,além dos transtornos causados pelo cancelamento de carrega e de abate. A partir da realizac4o de pilotos de adocao de IoT e de IA em 15 aviarios de umcooperativa agroindustrial do sul do Brasil, verificou-se que 0 monitoramento constanteda producao para uma tomada de decisdo mais assertiva levou a um aumento deprodutividade, uma vez que permitiu a reducao de problemas, bem como propiciouainda um planejamento e definigdes de estratégias precocemente, para que os impactosgerados fossem os minimos possiveis, reduzindo desperdicios, perda de produto, perdade tempo e otimizando as rotinas de trabalho. As tecnologias 4.0 tem-se mostrado um grande potencial para o aumento daqualidade da carne produzida, uma vez que as aves passam a ser criadas considerandose as exigéncias de bem-estar animal e monitoramento de sua produ¢ao, atendendoexigéncias do mercado internacional, colaborando, assim com a padronizacgao das avesabatidas e na reducao significativa da mortalidade, o que permite que o produtor e acooperativa tenham melhores resultados em cada lote e cause um menor impactoambiental, considerando o descarte de carcagas. ABDI — Agéncia Brasileira de Desenvolvimento Industrial. Mapeamento doinovacéo _— brasileiro. ©2021. —Disponivelhttps://agro40.abdi.com.br/SitePages/Layout/index.aspx. Acesso em: 6/5/23. ABREU, V.; ABREU, P. Os desafios da ambiéncia sobre os sistemas de aves no Brasil.Revista Brasileira de Zootecnia. V.40, p.1-14, 2011 (supl. Especial). Disponivel em: https://ainfo.cnptia.embrapa.br/digital/bitstream/item/42704/1/os-desafios-daambiencia-sobre-os-sistemas.pdf. Acesso em 24/9/2023. ABPA — Associacao Brasileira de Proteina Animal. Relatorio Anual 2023. 2023.Disponivel em: _ https://abpa-br.org/wp-content/uploads/2023/04/RelatorioAnual-2023.pdf. Acesso em 24/9/2023. CEPEA/CNA - Centro de Estudos Avancados em Economia Aplicada / ConfederacaoAgricultura e Pecudria) PIB do agronegoécio. Disponivelhttps://www.cepea.esalq.usp.br/upload/kceditor/files/PIB-do-A gronegocio-20set222.pdf. Acesso em: 10/5/23. EMBRAPA — Empresa Brasileira de Pesquisa Agropecuaria. Retrato da agriculturadigital brasileira. 2020. Disponivel em: _https://www.embrapa.br/en/busca-denoticias/-/noticia/54770717/pesquisa-mostra-o- retrato- da-agricultura-digitalbrasileira. Acesso em: 20/5/23. FABRI, F.; CACHON, J. Fatores que influem na produtividade do frango de cortemoderno. 2018. Disponivelhttps://www.cidasc.sc.gov.br/blog/2018/03/1 7/fatores-que-influem-na-produtividadedo-frango-de-corte-modero/. Acesso em 24/9/2023. IAGRO - Agé€ncia Estadual de Defesa Sanitaria Animal e Vegetal. 1016. Por que auniformidade das aves é tao importante para os abatedouros? Disponivel em:https://www.iagro.ms.gov.br/por- que- a- uniformidade-das-aves-e-tao-importantepara- os-abatedouros/#: ~:text=Na% 20abridora% 20de% 20abd%C3%B4men% 2C %20a, aumentar% 20a% 20incid%C3%A A ncia%20de% 20contamina%C 3%A 7%C3%A3o. Acesso em: 24/9/24. MAPA - Ministério da Agricultura, Pecuaria e Abastecimento. Cenarios e perspectivasda conectividade para o agro / Secretaria de Inovacao, Desenvolvimento Rural eIrrigacao — Brasilia: MAPA/AECS, 2021. Disponivelhttps://www.gov.br/agricultura/pt-br/assuntos/inovacao/conectividade-rural/livro.Acesso em: 6/5/23. MCKINSEY 1. The Internet of Things: Catching up to an accelerating opportunity. SCHMIDT, N.; SILVIA, C. Pesquisa e Desenvolvimento na Cadeia Produtiva deFrangos de Corte Disponivelhttps://pt.engormix.com/avicultura/nutricao-frangos-corte/pesquisadesenvolvimento-cadeia-produtiva_a47900/. Acesso em: 24/9/23. SCHWAB, K. A quarta revolucao industrial. Traducao de Daniel Moreira Miranda. SaoPaulo: Edipro, 2016. SILVA, L.; CORDEIRO NETO, F.; OLIVEIRA, J.; SANTANA, L. Desenvolvimentosem inteligéncia artificial na avicultura de frangos de corte. Anais do XIII SBIAgro,p.1-9, 2021. DOI: https://doi.org/10.5753/sbiagro.2021.18377. ZHONG, R.; XU, X.; KLOTZ, E.; NEWMAN, S. 2017. “Intelligent Manufacturing inthe Context of Industry 4.0: Review.” Engineering3(5): 616-30.http://dx.doi.org/10.1016/] ENG .2017.05.015."
}