{
    "abstract": "The need for the sprayer boom to be parallel to the ground duringoperation requires active suspension systems with controllers that minimize oscillations associated with rolling movement. This work proposes the integration of the zero-vibration (ZV) input shaping technique with model-based robustadaptive controllers, the MRAC and the VS-MRAC, comparing their results. Therobustness of VS-MRAC is evidenced with gains in tracking and control signalwhen it is integrated into input shaping.",
    "1. Introducao": " A produtividade agricola possui entre seus principais fatores limitantes a aplicacao controlada de fertilizantes e defensivos, sendo a barra de pulverizagao um dos principais implementos acoplado as maquinas agricolas para esta finalidade. E fato que os movimentos dabarra ao longo da operacao apresentados na Figura 1, principalmente a rolagem em tornodo eixo X, impactam o padrao de distribuigao dos produtos, podendo gerar areas semcobertura e irregulares. Consequentemente a uniformidade e qualidade da pulveriza¢gao térrea depende da estabilidade do sistema de suspensdo e estes requisitos de desempenhosao atingidos com a minimizacaéo das oscilagdes na barra que deve permanecer paralelaao solo durante a operacao. Como solugaéo comum para baixas frequéncias nas maquinas agricolas tem-se asuspensao ativa pendular. O ajuste do angulo a na Figura | é de interesse pratico, comoem [Deprez et al. 2002] que avaliaram o controlador em avanco com alocagao de polose zeros com base no lugar das raizes, sendo o atuador um motor DC em cenario comvelocidades de deslocamento entre 2 — 3 ms~! e 27m de comprimento de barra. Oscontroladores tem sido projetados com base em modelos identificados de segunda ordemsubamortecidos, como em [Deprez et al. 2002] e [Cui et al. 2019a]. Neste ultimo os autores justificam a necessidade de robustez as perturbagdes nao modeladas e incertezasparamétricas incidentes, principalmente com o aumento da velocidade do trator. Umasolug¢ao com dois graus de liberdade (2-DOF) foi apresentada por [Cui et al. 2019b],com compensador antecipatério de velocidade e PID em malha fechada, obtendo umareducao efetiva nas oscilag6es em testes de transitério, rastreamento senoidal e robustezas perturbacoes. Esta ideia remete a classica técnica de modelagem de entradas (inputshaping) para suavizacao (idealmente cancelamento) de vibragdes denominada posicast[Smith 1957], inicialmente apenas em feedforward, mas posteriormente integrada em maIha fechada por [Hung 2003]. Consiste basicamente de um controle em malha aberta querealiza a convolucao do sinal de entrada com uma sequéncia de impulsos (Figura 2), cujasamplitudes e instantes de aplicacao sao funcao da frequéncia natural w, e do coeficientede amortecimento € do sistema [Singh and Singhose 2002]. Figura 1. Movimento de rotacao (rolagem) da barra de pulverizagao em torno doeixo X [Kappaun et al. 2021] Desde entao varios shapers foram propostos e aplicados [Kasprowiak et al. 2022, Mohammed et al. 2020], partindo da versao mais simples com apenas dois sinais (ZeroVibration ZV), também denominado posicast de meio ciclo. VersOes mais robustas a incertezas paramétricas como o Zero Vibration Derivative (ZVD) foram comparadas em[Singhose et al. 1995] e estratégias adaptativas como em [Dhame and Jayasuriya 2003]e de identificagao de frequéncias [Chatlatanagulchai et al. 2015, Chu and Hu 2016,Goube] et al. 2020] foram combinadas nesta mesma perspectiva de agregacao de insensibilidade paramétrica e reprojeto em tempo de execucao. Nao identificou-se contudoaplicagdes do input shaping em sistemas de suspensao de maquinas agricolas ou de seusimplementos, como é 0 caso de barras de pulverizagao. Outras abordagens de shapersrobustos baseiam-se na integracao de controle por estrutura varidvel e seus modos deslizantes (sliding modes, SMC) [Utkin et al. 2009]. O SMC é uma técnica nao linear quetem como base uma lei de controle chaveada, fungao das variaveis de estado do sistema. A uniaéo do SMC com o controle adaptativo por modelo de referéncia (MRAC)originou o denominado VS-MRAC, que depende apenas de medidas da entrada e saidada planta e mantém as caracteristicas de robustez a incertezas paramétricas, disturbiose dinémicas nao modeladas [Costa and Hsu 1992]. O VS-MRAC desde entao evoluiuconsideravelmente em sua abordagem direta e indireta, enfatizando aspectos praticos deimplementa¢ao e suaviza¢ao do sinal chaveado de alta frequéncia [Dias et al. 2021]. Este trabalho apresenta resultados do input shaping ZV aplicado ao modelo dasuspensao ativa de barra de pulverizagao conforme [Cui et al. 2019a]. Em seguida éprojetado um controlador MRAC em conjunto com o ZV na configuragao 2-DOF, comsimulagao nos problemas de rastreamento de trajet6ria senoidal e posicionamento angular da barra, sujeito a disturbios externos. Estes resultados sao entao comparados aoVS-MRAC padrao em termos de robustez.",
    "2. Definicao do Problema": " O sistema de suspensdo ativa deve garantir que a barra siga as ondulacdes de baixafrequéncia do terreno de modo a manté-la paralela ao solo. Os ’’*bragos” laterais sao conectados ao eixo central por juntas de revolucao. A Figura 3 adaptada de [Cui et al. 2019a]descreve geometricamente o sistema. A barra é suspensa do suporte pela haste OP e oponto P é 0 centro de massa. A haste é conectada ao suporte na junta localizada no pontoO, que forma um angulo ¢ com a vertical. Sob agao apenas de suspensao passiva, a barragira sobre O, mas sob acao do sistema de controle que varia 0 comprimento do cilindro/,, também gira em torno de P. As alturas relativas ao alvo séo medidas nas extremidades Figura 3. Descrigao geomeétrica da suspensao ativa pendular. Adaptada de[Cui et al. 2019a] pelos sensores ultrassom L; e L,., que permitem calcular o angulo de inclinacgao / da barraem relacéo ao alvo, dada a distancia D,, entre os dois sensores: A cadeia cinematica dos vetores associados aos elos fixos /;, 1 = 1, 2,3,4 é dada> > => > . oo, ipor: J) + lg + ly = ls + lg, onde lg é 0 componente ajustavel incorporado ao cilindro.Visto que quando a haste OP esta na vertical o comprimento inicial do cilindro é lo,conclui-se que 0 deslocamento yg da haste do pistao é dada por yg = lg — lg. O detaIhamento da modelagem pelo método de Lagrange pode ser visto em [Cui et al. 2019a].Aqui é utilizado o modelo que relaciona a entrada /; em metros com o angulo de saida6 da barra, cujos parametros foram obtidos em [Cui et al. 2019a] por minimos quadradosnao linear e é dado por: com zeros em —2.59 e +11, 604 e polos estaveis em —0.417 + 1.357. Este zero instavelem +11, 604 pode ser visto como uma dindmica parasita que sera desconsiderada para oprojeto do modelo de referéncia com grau relativo unitario. Fazendo c. = 0 e denominando k,, o ganho de alta frequéncia da planta, (2) pode ser escrita como:",
    "3. Projeto de Controladores Input Shaping, MRAC e VS-MRAC": " O controlador ZV é projetado conforme [Singh and Singhose 2002], de modo que a amplitude A, é dada por: e Ay = 1— A. O primeiro pulso é aplicado em t,; = 0 e o segundo pulso de amplitude A»é aplicado em tz = a = “4, COM Wg = Wnr/1 — €2 e Ty € o periodo de amortecimento.Portanto o sinal de comando X(s) (neste caso a referéncia) é composto por estas duaspartes (Figura 4) gerando o sinal X,(s) [Oliveira and Boaventura-Cunha 2013]. Usualmente o subscrito s refere-se neste contexto a shaped. Para a planta (2), os parametros doZV sao: A; = 0.73, Ag = 0.27, tg = 2.338. A integragao em malha fechada de um modelo de referéncia sobreamortecido ecom convergéncia mais rapida é uma estratégia bastante utilizada. O projeto consiste basicamente em definir este modelo M(s) e estabelecer as leis adaptativas para os parametrosdo controlador, considerando uma abordagem direta [Ioannou and Sun 2012]. Por exemplo, na Figura 5 é perceptivel a ideia de fazer a planta se comportar como um modelomais rapido que (2) com polos em —0.8 + 0.47 er = 0.01m. Além disto,apresenta oresultado de aplicacéo do ZV em (2), com notavel reducao de overshoot de 49% para 8%e tempo de estabilizacao de 11s para 6s. O controlador MRAC para sistema de segunda ordem tem sinal de controle u dado com 0, = —A v1 + gu, ve = —A\\v2 + gy. Neste caso, A; = 0.8,g = 0.1. Com basena teoria de estabilidade de Lyapunov, A lei adaptativa para o vetor de parametros docontrolador 6 é dada por: A modificagao em (7) para agregar estrutura variavel e obter o VS-MRAC consisteem utilizar projecdo, ou seja, a hipdtese de que limitantes superiores séo0 conhecidos paraos parametros do controlador, definindo as amplitudes dos relés de modo a garantir umacondicao suficiente de estabilidade assint6tica, com a condi¢géo 6 > |6*|. Ou seja, as leischaveadas se tornam: e, para a planta em (3) e modelo de referéncia com ganho unitario dado por: Para a referéncia 6, = 1°, foi considerada a adicao de perturba¢éo senoidal deamplitude 3° e frequéncia 0.1 Hz para t >= 15s. A Figura 6 apresenta resultados doMRAC e VS-MRAC com ZV. Ha uma pequena reducéo das métricas de somatério doerro quadratico (ISE) e do total do médulo do sinal de controle, conforme Tabela |. Ainsensibilidade do VS-MRAC ao disttrbio é visivel, embora com sinal |, chaveado.",
    "4. Simulacoes e Resultados": "",
    "4.1. Caso 1: Posicionamento da barra a partir do repouso 3 = 0°": " Figura 7. VS-MRAC para £, = 1° com perturbagao 3sin(0.27t) para t >= 15s Para a referéncia 64 = 1°, foi considerada a adicao de perturbac¢ao senoidal de amplitude3° e frequéncia 0.1 Hz para t >= 15s. A Figura 6 apresenta resultados do MRAC com esem ZV. H4 uma pequena redugao das métricas de somatorio do erro quadratico (ISE) e dototal do médulo do sinal de controle, conforme Tabela 1. A insensibilidade do VS-MRACao distirbio é visivel na Figura 7, embora com sinal [4 chaveado.",
    "4.2. Caso 2: Rastreamento de referéncia senoidal": " Neste cendrio, um movimento de rolagem foi simulado com amplitude de 3° a frequénciade 0.1Hz conforme [Cui et al. 2019b]. Tendo em vista 0 padrao observado de redugaono ISE com a inclusao do ZV, o MRAC e VS-MRAC sao apresentados apenas com ZVintegrado, na Figura 8.",
    "5. Conclusoes": " Este trabalho apresentou o efeito do controle feedforward Zero Vibration para reducaode oscilagdes em modelo matematico de barra de pulverizacgao, em problemas de posicionamento angular e seguimento de trajet6ria senoidal replicando 0 movimento do tratorem operacao. Quando em malha aberta, a reducao é significativa. Ao integrar-se comcontroladores MRAC e VS-MRAC em malha fechada 0 beneficio do ZV é em parte compensado pela realimentagao, necessitando de reprojeto em tempo de execucgao com basena saida da planta para maior efeito. Contudo, aponta para reducao de erro de rastreamento e sinal de controle. Em trabalhos futuros, técnicas de suavizagéo do comandou para o VS-MRAC podem ser avaliadas, bem como comparacgao com outras técnicas,como VS-APPC (alocacao de polos) e VS-ABC (backstepping).",
    "6. Agradecimentos": " O presente trabalho foi realizado com apoio da Coordenagao de Aperfeigoamento de Pessoal de Nivel Superior - Brasil (CAPES) - Cédigo de Financiamento 001 Chatlatanagulchai, W., Chotana, S., and Prutthapong, C. (2015). Direct adaptive inputshaping using on-line frequency information and extremum-seeking optimization. Kasetsart Journal - Natural Science, 49(4):626—-638. Chu, Z. and Hu, J. (2016). An improved recursive least square—based adaptive inputshaping for zero residual vibration control of flexible system. Advances in MechanicalEngineering, 8(4):1-14. Costa, R. and Hsu, L. (1992). Robustness of vs-mrac with respect to unmodelled dynamics and external disturbances. Adaptive Control and Signal Processing, 6(1):19-33. Cui, L., Mao, H., and Xue, X. (2019a). Hydraulic-drive roll movement control of a sprayboom using adaptive robust control strategy. Advances in Mechanical Engineering,11(2):1-15. Cui, L., Xue, X., Le, F., Mao, H., and Ding, S. (2019b). Design and experiment of electrohydraulic active suspension for controlling the rolling motion of spray boom. Int JAgric and Biol Eng, 12(4):72-81. Deprez, K., Anthonis, J., Ramon, H., and Brussel, H. (2002). Development of a slowactive suspension for stabilizing the roll of spray booms, part 2: controller design.Biosystems Engineering, 81(3):273-279. Dhame, A. and Jayasuriya, S. (2003). Increasing the robustness of the input-shapingmethod using adaptive control. In Proceedings of American Control Conference, volume 2, pages 1578— 1583. Dias, S., Queiroz, K., and Aratyo, A. (2021). Controlador adaptativo robusto para oprocesso de tanque quadruplo. In XV Simposio Brasileiro de Automacdao Inteligente,pages 1392-1399. Goube]j, M., Vyhlidal, T., and Schlegel, M. (2020). Frequency weighted h2 optimizationof multi-mode input shaper. Automatica, 121:109202. Ioannou, P. and Sun, J. (2012). Robust Adaptive Control. Dover, New York, 2nd edition. Kappaun, R., MeiraJr., A., and Walber, M. (2021). Parameters for modeling passivesuspensions of spray bars. Engenharia Agricola, 41(3):368-378. Kasprowiak, M., Parus, A., and Hoffmann, M. (2022). Vibration suppression with use ofinput shaping control in machining. Sensors, 22(2186):1—22. Mohammed, A., Alghanim, K., and Andani, M. (2020). An adjustable zero vibration input shaping control scheme for overhead crane systems. Shock and Vibration,2020(7879839): 1-7. Oliveira, P. and Boaventura-Cunha, J. (2013). Gantry crane control: a simulation casestudy. In 20/3 2nd Experiment@ International Conference (exp.at’13), pages 58-63. Singh, T. and Singhose, W. (2002). Input shaping/time delay control of maneuvering flexible structures. In Proceedings of the 2002 American Control Conference, volume 3,pages 1717-1731. Singhose, W., Singer, N., and Seering, W. (1995). Comparison of command shapingmethods for reducing residual vibration. In Proceedings of European Control Conference, pages 1126-1131. Smith, O. (1957). Posicast control of damped oscillatory systems. In Proceedings of theIRE, pages 1249-1255. Utkin, V., Guldner, J., and Shi, J. (2009). Sliding Mode Control in Electro-MechanicalSystems. CRC Press, Boca Raton, 2nd edition."
}