{
    "abstract": "This work presents preliminary results of a recognition, classification andcounting system for scale cochineal (Diaspis echinocacti) in cactus pear samples,with the objective of predicting first and third instar stages of the cochineal, inaddition to identifying males and females. Machine learning algorithms and theMask R-CNN model, image processing techniques, and the use of technologies suchas cloud computing were used. There are several challenges along the way, such asdata labeling, demand for high computational processing power, with that there isroom for improvement, but the model has learned the patterns well, and there is",
    "1. Introducao": " A palma forrageira é um suporte alimentar de grande valor para a pecuaria do semiarido,com caracteristicas como alta palatabilidade, produ¢ao de biomassa, potencial nutricionale resisténcia a seca. Além do nordeste brasileiro, paises como Argélia, Africa do Sul,Israel, México, USA e Colémbia destacam-se em seu cultivo para alimentacao derebanhos. Contudo, é sujeita a acao de pragas, onde destaca-se a cochonilha de escama(Diaspis echinocacti). Esta pode enfraquecer a palma forrageira, deixar com tonsamarelos e provocar queda das raquetes. Nao havendo o manejo e tratamento adequadopode comprometer o palmal. Identificar em laboratorio a a¢gao de produtos naturais decontrole como 6leos vegetais tem sido alvo de pesquisas, como em Chagas et al. (2018).A analise é realizada em amostras de raquetes selecionadas e a contagem das cochonilhasrealizadas por inspecao visual com auxilio de microscépio, embora ferramentas computacionais também tenham sido propostas (OLIVEIRA et al., 2021), mas paracontagem total dos insetos, independente do estagio de desenvolvimento. Um outrodesafio consiste em identificar os insetos conforme o ciclo de vida, pelo impacto de maiordispersao nos primeiros sinais de aparecimento da praga. A cochonilha consiste emdiferentes estagios de desenvolvimento. A observacao de uma superficie pulverulenta nasfaces da palma, pode indicar uma infestagao de ninfas de 1° instar. Ao fixarem-se, asfémeas comecam a evoluir com aspecto circular ou elipsdide, passando pelo 2° e 3°instares. Ja os machos possuem formato cilindrico, alongado e possuem asas. Figura 1. (a) Presenga da cochonilha de escama (Diaspis echinocacti) na palma. (b) ciclode vida com respectivos estagios Este trabalho apresenta a deteccao e segmentacao dos estagios de desenvolvimentoda cochonilha de escama (classes) por meio do aprendizado supervisionado profundocom rede neural convolucional do tipo Mask R-CNN (HE et al, 2017; REHMAN etal., 2021). A partir de imagens com amostras de raquetes de palma, 0 modeloproposto reconhece, classifica e quantifica a respectiva classe.",
    "2. Problematica": " Em visao computacional a detec¢ao de objetos é um desafio computacional, sendoassociada a etapa de segmentacao. Sao considerados dois tipos de segmenta¢ao: asemantica, que rotula cada pixel de uma imagem com base em sua respectiva classe,e a segmentacao por instancias, onde cada instancia (objeto) ¢ tratada como unitaria,independente de sua classe. Em resumo, a segmentac¢ao de instancias detecta cadaobjeto individual dentro de um grupo de objetos semelhantes (MEIRA, 2020),conforme observado na Figura 2. Usualmente requer maior poder computacional.",
    "3. Metodologia": " Este trabalho utiliza o aprendizado de maquina supervisionado, onde é necessariofornecer dados de treinamento (imagens de exemplo rotuladas) para o modeloaprender e identificar os padroes. O modelo utilizado neste trabalho foi o Mask RCNN, uma arquitetura de rede neural convolucional baseada em regides (R-CNN)bastante utilizada para f[a||tarefa||de| segmentacdo de __ instancias. | bastante _utilizada__para_ [a || tarefa || de | segmentacdo de __instancias._E uma extensao do algoritmo Faster R-CNN, utilizado para deteccao deobjetos. Produz como resultado os bounding boxes dos respectivos objetos com opercentual de acuracia na deteccao. A técnica adiciona uma camada para predizermascaras de segmentacao para cada regiao de interesse (RoI) em paralelo com astradicionais camadas para classificacgao e regressao. Esta camada adicional ¢ umarede convolucional simples aplicada a cada Rol, com predi¢ao pixel a pixel.Internamente o modelo ¢ composto por dois estagios, sendo 0 primeiro responsavelpor gerar regides potenciais de existéncia de objetos (proposals, RPN) e o segundoprediz a classe, gerando os bounding boxes e mascaras, conforme a visao geral naFigura 3. Foi utilizada a biblioteca Mask RCNN! com a linguagem de programacdopython versao 3.7. Antes de criar o modelo é necessario elaborar 0 imageset para oproblema em questao. O imageset é composto por 172 imagens utilizadas em Oliveiraet. al. (2021), e cada imagem com sua anotacao XML. As anotacoes foram feitas noLabel Studio em formato pascal VOC (Visual Object Classes) e formato de caixasretangulares. O formato das imagens sao .jpg (JPEG) na propor¢ao quadrada de 300pixels, e foram recortadas de imagens maiores (Figura 4); variam em resolu¢ao e ' Muitos exemplos e artigos utilizam a versao disponivel em https://github.com/matterport/Mask RCNN escala dos objetos. Esta ¢é uma das contribuigdes deste trabalho, visto nao haverimageset similar para cochonilhas de escama disponiveis na web. Figura 4. Rotulagem com caixas delimitadoras. Preto: 1° instar. Vermelho: fémeas (2° e 3°instares). Azul: machos. Para treinar o modelo, ¢ recomendado uma maquina bastante robusta e com GPU. Paraganho de performance, foram utilizados recursos de Google Cloud onde se prepara umamaquina remota com especificagdes personalizadas. Inicialmente foram realizadostreinos sem GPU, mas foi inviavel com tempo de treino muito longo, cada passo levariaem média 2 minutos; no segundo momento os treinos foram executados em GPU umaNvidia T4, onde foi observado uma redugao drastica no tempo de treino, cada passo sendoexecutado em média | segundo, e um treino total durou em média 3 minutos.",
    "4.1. Treino do modelo": " A propor¢ao utilizada foi de 80/20, sendo 80% dos dados para treino e 20% para teste.Os dados nao foram embaralhados para evitar aleatoriedade e observar melhor as variacoes dos hiperparametros (repetibilidade). Foi utilizado também data augmentationna proporcao de +100% apenas com transformacdes geomeéetricas. O data augmentationamplia o dataset no treinamento e evita o overfit, melhorando a previsao geral do modelo.Neste trabalho se utilizou taxa de 100%, ou seja, foram geradas mais 172 imagens comtransformacoes geomeéetricas de escala, rotacao, e espelhamentos vertical e horizontal comOs seguintes parametros: Fliplr(1), Flipud(1), Affine(rotate=(-45, 45)), Affine(rotate=(90, 90)) e Affine(scale=(0.75, 1.2)); usando a biblioteca imgaug. Varias execucoes foramaplicadas com variagoes de hiperparametros. Foi observado que um treino de camadasmais profundas propiciam resultados melhores que somente camadas iniciais ou ‘heads’.Um dos hiperparametros relevantes que foi observado foi a escala das ancoras (Figura 5)na Rede de Propostas de Regiao (RPN), chamado de RPN ANCHOR SCALES. Valoresmenores melhoraram a precisao do modelo. Figura 5. A ilustragao representa caixas de ancoras, que podem serem diferentes escalas. O modelo que expressou melhores resultados foi teve seus parametros configurados parabatch_size = 3, steps per epoch = 140, validation steps = 40, learning rate = 0.005,learning momentum = 0.4, rpn_anchor_ratios = [0.5, 1, 1.5] e rpn_anchor scales =[10,30,50, 75,92]",
    "5. Resultados preliminares": " Foram salvos alguns outputs de treino para estimar o desempenho do modelo, a seguirmétricas de previséo de classe, da é¢poca 2 a 4 com 140 iteragdes: Epoch 2/4,mrenn_class loss: 0.3959 e val _mrenn_class_ loss: 0.4007; Epoch 3/4, mrcnn_class_ loss:0.3585 e val _mrenn_ class loss: 0.4043; Epoch 4/4, mrcnn_ class loss: 0.3315 eval mrenn_ class loss: 0.3834. A Figura 6 apresenta alguns resultados. Em casos de aglomeracao (Figura 6a), o modelonao foi bem em prever com acuracia todos os registros. O desejado, ¢ o modeloreconhecer aglomerados do terceiro instar de cochonilhas fémeas e nao somente objetos individuais. Isso deve ser resolvido, possibilitando assim avaliar a precisao do modelo;uma alternativa seria adicionar uma classe extra para representar estes aglomerados, issofacilitaria o reconhecimento para o modelo. O modelo teve melhor éxito em reconhecer diferentes escalas e tamanhos, gracas ao Mask R-CNN, apresentando boa acuracia. Figura 6 Saidas em diferentes tamanhos a) e escalas b). (reconhecimento de ninfa: 1 instar efémea (2. e 3 instares)) Chagas, M.C.M., Silva, E.C.S., Nascimento, S.M., Lima, G.F.C., Lima, T.C.C. (2018).Cochonilha de escama na palma forrageira: aspectos bioldgicos e estratégias de manejo. He, K., Gkioxari, G., Dollar, P., Girshick, R. (2017). Mask R-CNN. In: IEEE Int. Conf.on Computer Vision (ICCV), p. 2980-2988. Meira, N. Edge AI: mask r-cnn e segmentacao de instancias. (2020). Disponivel em:<http://www2.decom.ufop.br/imobilis/segmentacao-instancias/>. Acesso: 17/07/23. Rehman, Z.; Khan, M.A., Ahmed, F., Damasevicius, R., Naqvi, S.R., Nisar, W., Javed,K. (2021). Recognizing apple leaf diseases using a novel parallel real-time processingframework based on Mask R-CNN and transfer learning: an application for smart Xiang, Z. Simple understanding of Mask R-CNN. (2018). Disponivel em:https://alittlepain833.medium.com/simple-understanding-of-mask-rcnn-134b5b3300e95.Acesso: 17/07/23. Oliveira, J.B., Araujo, A.M.S., Teixeira, L.R.L., Silva, E.C.S., Santana, L.E.A.S.,Rodrigues, T.C., Chagas, M.C.M. (2021). Uma proposta de sistema embarcado paracontagem automatizada de cochonilhas de escama em laboratorio. In: Anais do SimposioBrasileiro de Automac¢ao Inteligente, p. 2063-2068."
}